#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterSheetTasksTab

#include "Basic.hpp"

#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterSheetTasksTab.CharacterSheetTasksTab_C
// 0x0030 (0x02D8 - 0x02A8)
class UCharacterSheetTasksTab_C final : public URBBadgesTabWidget
{
public:
	class UImage*                                 bottom_border;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomBorder;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MainBackground_1;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTasksWidget_C*                         TasksWidget_1;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Top_border;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopBorder;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Event_OnTabSelected();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

	class FText GetPageTitle() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterSheetTasksTab_C">();
	}
	static class UCharacterSheetTasksTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterSheetTasksTab_C>();
	}
};
static_assert(alignof(UCharacterSheetTasksTab_C) == 0x000008, "Wrong alignment on UCharacterSheetTasksTab_C");
static_assert(sizeof(UCharacterSheetTasksTab_C) == 0x0002D8, "Wrong size on UCharacterSheetTasksTab_C");
static_assert(offsetof(UCharacterSheetTasksTab_C, bottom_border) == 0x0002A8, "Member 'UCharacterSheetTasksTab_C::bottom_border' has a wrong offset!");
static_assert(offsetof(UCharacterSheetTasksTab_C, BottomBorder) == 0x0002B0, "Member 'UCharacterSheetTasksTab_C::BottomBorder' has a wrong offset!");
static_assert(offsetof(UCharacterSheetTasksTab_C, MainBackground_1) == 0x0002B8, "Member 'UCharacterSheetTasksTab_C::MainBackground_1' has a wrong offset!");
static_assert(offsetof(UCharacterSheetTasksTab_C, TasksWidget_1) == 0x0002C0, "Member 'UCharacterSheetTasksTab_C::TasksWidget_1' has a wrong offset!");
static_assert(offsetof(UCharacterSheetTasksTab_C, Top_border) == 0x0002C8, "Member 'UCharacterSheetTasksTab_C::Top_border' has a wrong offset!");
static_assert(offsetof(UCharacterSheetTasksTab_C, TopBorder) == 0x0002D0, "Member 'UCharacterSheetTasksTab_C::TopBorder' has a wrong offset!");

}

