#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterSheetTasksTab

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CharacterSheetTasksTab.CharacterSheetTasksTab_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct CharacterSheetTasksTab_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(CharacterSheetTasksTab_C_OnFocusReceived) == 0x000008, "Wrong alignment on CharacterSheetTasksTab_C_OnFocusReceived");
static_assert(sizeof(CharacterSheetTasksTab_C_OnFocusReceived) == 0x0001B0, "Wrong size on CharacterSheetTasksTab_C_OnFocusReceived");
static_assert(offsetof(CharacterSheetTasksTab_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'CharacterSheetTasksTab_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(CharacterSheetTasksTab_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'CharacterSheetTasksTab_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(CharacterSheetTasksTab_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'CharacterSheetTasksTab_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheetTasksTab_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'CharacterSheetTasksTab_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function CharacterSheetTasksTab.CharacterSheetTasksTab_C.GetPageTitle
// 0x0018 (0x0018 - 0x0000)
struct CharacterSheetTasksTab_C_GetPageTitle final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(CharacterSheetTasksTab_C_GetPageTitle) == 0x000008, "Wrong alignment on CharacterSheetTasksTab_C_GetPageTitle");
static_assert(sizeof(CharacterSheetTasksTab_C_GetPageTitle) == 0x000018, "Wrong size on CharacterSheetTasksTab_C_GetPageTitle");
static_assert(offsetof(CharacterSheetTasksTab_C_GetPageTitle, ReturnValue) == 0x000000, "Member 'CharacterSheetTasksTab_C_GetPageTitle::ReturnValue' has a wrong offset!");

}

